УТ_для_edt.РасширениеСмарт/src/AccumulationRegisters/ТоварыОрганизаций/ТоварыОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТоварыОрганизаций</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources>
    <name>Количество</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions>
    <name>АналитикаУчетаНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>ВидЗапасов</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

УТ_для_edt.РасширениеСмарт/src/Enums/ПорядокОплатыПоСоглашениям/ПорядокОплатыПоСоглашениям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ПорядокОплатыПоСоглашениям</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>РасчетыВРубляхОплатаВРублях</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>РасчетыВВалютеОплатаВРублях</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>РасчетыВВалютеОплатаВВалюте</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>РасчетыВРубляхОплатаВВалюте</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/Enums/ТипыНалогообложенияНДС/ТипыНалогообложенияНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыНалогообложенияНДС</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ПродажаНеОблагаетсяНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПродажаОблагаетсяНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПродажаНаЭкспорт</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПродажаОблагаетсяЕНВД</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НалоговыйАгентПоНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОблагаетсяНДСУПокупателя</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВводОСВЭксплуатацию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/Enums/ВариантыОформленияПродажи/ВариантыОформленияПродажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ВариантыОформленияПродажи</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>РеализацияТоваровУслуг</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>АктНаПередачуПрав</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/Catalogs/Организации/Организации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Организации</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ИНН</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>КПП</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="4a3b4661-75a6-4317-9e52-a21fb3ad20b9">
    <name>ГоловнаяОрганизация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="64303e94-490e-4229-a86f-9d6a6769b763">
    <name>СвидетельствоСерияНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a184b1dd-510a-46f6-b38c-2a1c8ff0217a">
    <name>ИндивидуальныйПредприниматель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0038fc7e-3157-476b-824d-811a30639c88">
    <name>ЦифровойИндексОбособленногоПодразделения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="11eb9dbe-02b3-4892-b634-f243b2dfd2f1">
    <name>НаименованиеСокращенное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0b153de3-87fe-4907-9e94-8556af48fda2">
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="685363b5-d549-4059-81c3-83f4001dac92">
    <name>НаименованиеМеждународное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="1a2fdd27-2959-4e3e-9039-80e8cebcf1e2">
    <name>ОГРН</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="38df9827-83de-429d-a872-d44c4a5b383a">
    <name>КодОКВЭД</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>8</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f17d55e6-7114-4f91-bee2-e2e64e65fa8b">
    <name>СвидетельствоДатаВыдачи</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9e332fa6-d24a-436f-bac7-5e086c273763">
    <name>КодОКВЭД2</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>8</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="33c042cb-b26c-4c0d-acac-fde61b334c1f">
    <name>КодПоОКПО</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d9e54389-8d99-4508-af2e-411a4520ca52">
    <name>КрупнейшийНалогоплательщик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1affc249-13d0-477e-b7a9-8a2b51caeb55">
    <name>ДатаРегистрации</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="75dc325f-619e-4beb-99ba-e69da503125b">
    <name>Префикс</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>2</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0625e5ef-5727-4476-afca-88c6fce30fcd">
    <name>КодНалоговогоОрганаПолучателя</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>4</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ecc0dbb2-ffb6-44df-9a60-571932153ea5">
    <name>ДопускаютсяВзаиморасчетыЧерезГоловнуюОрганизацию</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="83555d53-4331-4f0c-9a15-c46c7d8c9e73">
    <name>НеЗаполнятьПодразделенияВМероприятияхТрудовойДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="215bcd7a-1ae8-47a8-8fab-599989e59bc9">
    <name>смартГрузоотправители</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="73fa78e8-0e0d-4300-884d-53074a97228b">
      <name>Склад</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="0a933e94-c895-4b1a-ac32-fc1443ce396f">
      <name>Грузоотправитель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/CommonModules/смартОбработкаМетодовPost/Module.bsl
Функция смартОбработкаМетодовPOST(ПараматрыВходящие) экспорт
	
	Если ПараматрыВходящие.ИмяМетода="mov" тогда
		Возврат СоздатьДокументПеремещения(ПараматрыВходящие);
	ИначеЕсли ПараматрыВходящие.ИмяМетода="implem" тогда
		Возврат ВыгрузитьДокументРеализации(ПараматрыВходящие);
	ИначеЕсли ПараматрыВходящие.ИмяМетода="offset" тогда
		Возврат СоздатьДокКорректировкиСписания(ПараматрыВходящие); 
	ИначеЕсли ПараматрыВходящие.ИмяМетода="operation" тогда
		Возврат СоздатьДокКорректировкиРегистров(ПараматрыВходящие);
	//++ #Б5136 смарт: Шляпников 27.01.2026 / Маркировка радиоэлектронной продукции. Синхронизация данных. Приемка товара.
	ИначеЕсли ПараматрыВходящие.ИмяМетода="universaldata" тогда
		Возврат ЗагрузитьДанныеЧерезУниверсальныйОбменДанными(ПараматрыВходящие);
	//-- #Б5136 смарт: Шляпников 27.01.2026
	КонецЕсли;
		
КонецФункции // смартОбработкаМетодовPOST()

Функция СоздатьДокументПеремещения(ПараматрыВходящие)
	СтруктураОтвет = Новый Структура("ДанныеОтвета,Отработало,ТекстОшибки,КодОтвета","",Истина,"",200);	
	ТекстОшибки="";
	ТекстУспех="";
	//1.десериализуем данные о клиенте из JSON
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ПараматрыВходящие.ТелоЗапроса);
	ДанныеНоменклатуры = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	
	//2. Задаем значения реквизитам поиска
	ОтправительИНН=ПараматрыВходящие.ПараметрыЗапроса.Получить("INNout");
	ПолучательИНН=ПараматрыВходящие.ПараметрыЗапроса.Получить("INNin");
	ДатаФормирования =Дата(ПараматрыВходящие.ПараметрыЗапроса.Получить("Data"));
	
	ТЗноменклатура=Новый ТаблицаЗначений;
	ТЗноменклатура.Колонки.Добавить("Код",ОбщегоНазначенияБПКлиентСервер.ПолучитьОписаниеТиповСтроки(20));
	ТЗноменклатура.Колонки.Добавить("Наименование",ОбщегоНазначенияБПКлиентСервер.ПолучитьОписаниеТиповСтроки(200));
	ТЗноменклатура.Колонки.Добавить("Количество",ОбщегоНазначенияБПКлиентСервер.ПолучитьОписаниеТиповЧисла(15,3));
	Для Каждого СтрМасс из ДанныеНоменклатуры Цикл
		НоваяСтрока=ТЗноменклатура.Добавить(); 
		НоваяСтрока.Код= СтрМасс.код;
		НоваяСтрока.Наименование=СтрМасс.Номенклатура;
		НоваяСтрока.Количество=СтрМасс.Количество;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц=Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЗ.Наименование КАК Наименование,
	|	ТЗ.Код КАК Код,
	|	ТЗ.Количество КАК Количество
	|ПОМЕСТИТЬ ВременнаяТаблица
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	ВременнаяТаблица.Количество КАК Количество
	|ПОМЕСТИТЬ СписокНоменклатуры
	|ИЗ
	|	ВременнаяТаблица КАК ВременнаяТаблица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО ВременнаяТаблица.Наименование = Номенклатура.Наименование
	|			И ВременнаяТаблица.Код = Номенклатура.Код
	|			И (НЕ Номенклатура.ЭтоГруппа)
	|			И (НЕ Номенклатура.ПометкаУдаления)
	|";
	Запрос.УстановитьПараметр("ТЗ",ТЗноменклатура);
	РезультатЗапроса=Запрос.ВыполнитьПакет();
	ТЗСписокСписания=ВывестиРезультатМенеджераВременныхТаблиц(Запрос.МенеджерВременныхТаблиц, "СписокНоменклатуры");
	
	Если ТЗСписокСписания.Количество()<0 тогда
		ЗаполнитьСтруктуруОтвета(СтруктураОтвет,405,"Не найдена номенклатура в УТ",ложь,"");
		Возврат СтруктураОтвет;
	КонецЕсли;
	
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ТоварыОрганизацийОстатки.КоличествоОстаток КАК Количество,
	//++ смарт:ММ #016 161 23.01.2020 - обновление 11.4.7.150
	//|	ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.Склад КАК Склад,
	|	ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.МестоХранения КАК Склад,
	//-- смарт:ММ 23.01.2020
	|	ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура
	|ИЗ
	|	РегистрНакопления.ТоварыОрганизаций.Остатки(
	|			&Период,
	|			Организация.ИНН = &ОрганизацияИНН
	|				И АналитикаУчетаНоменклатуры.Номенклатура.Ссылка В
	|					(ВЫБРАТЬ
	|						СписокНоменклатуры.Номенклатура
	|					ИЗ
	|						СписокНоменклатуры КАК СписокНоменклатуры)) КАК ТоварыОрганизацийОстатки
	|ИТОГИ
	|	СУММА(Количество)
	|ПО
	|	Склад";
	
	Запрос.УстановитьПараметр("ОрганизацияИНН", ОтправительИНН);
	Запрос.УстановитьПараметр("Период", Новый Граница(ДатаФормирования,ВидГраницы.Включая));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() тогда
		ЗаполнитьСтруктуруОтвета(СтруктураОтвет,405,"Не найдены остатки в УТ",ложь,"");
		Возврат СтруктураОтвет;
	КонецЕсли;
	
	//Получение вида цены по наименованию
	ЗапросВидЦены=Новый Запрос; 
	ЗапросВидЦены.Текст="ВЫБРАТЬ
	|	ВидыЦен.Ссылка КАК ВидЦены
	|ИЗ
	|	Справочник.ВидыЦен КАК ВидыЦен
	|ГДЕ
	|	ВидыЦен.Наименование = &Наименование";
	ЗапросВидЦены.УстановитьПараметр("Наименование","Себестоимость");
	ВыборкаВидЦены=ЗапросВидЦены.Выполнить().Выбрать();
	Если ВыборкаВидЦены.Следующий() тогда
		ВидЦены=ВыборкаВидЦены.ВидЦены;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДокПередачи=Документы.ПередачаТоваровМеждуОрганизациями.СоздатьДокумент();
		ДокПередачи.ХозяйственнаяОперация=Перечисления.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию;
		ДокПередачи.Дата=ДатаФормирования;
		ДокПередачи.ДатаПлатежа=ДатаФормирования;
		ДокПередачи.Организация=Справочники.Организации.НайтиПоРеквизиту("ИНН",ОтправительИНН);
		ДокПередачи.ОрганизацияПолучатель=Справочники.Организации.НайтиПоРеквизиту("ИНН",ПолучательИНН);
		ДокПередачи.Подразделение=Справочники.СтруктураПредприятия.НайтиПоНаименованию("Головной офис Москва");
		ДокПередачи.Склад=ВыборкаДетальныеЗаписи.Склад;
		ДокПередачи.ЦенаВключаетНДС=Истина;
		ДокПередачи.Валюта=Константы.ВалютаУправленческогоУчета.Получить();
		ДокПередачи.ВалютаВзаиморасчетов=Константы.ВалютаУправленческогоУчета.Получить();
		ДокПередачи.ПорядокОплаты=Перечисления.ПорядокОплатыПоСоглашениям.РасчетыВРубляхОплатаВРублях;
		ДокПередачи.НалогообложениеНДС=Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
		ДокПередачи.ВариантОформленияПродажи=Перечисления.ВариантыОформленияПродажи.РеализацияТоваровУслуг;
		ДокПередачи.Комментарий="Синхронизация остатков товаров";
		ВыборкаНоменклатуры=ВыборкаДетальныеЗаписи.Выбрать();
		Пока ВыборкаНоменклатуры.Следующий() цикл
			ОтборСтрокиТЗ=Новый Структура("Номенклатура",ВыборкаНоменклатуры.Номенклатура);
			МассивНашли=ТЗСписокСписания.НайтиСтроки(ОтборСтрокиТЗ);
			Если МассивНашли[0].Количество>0 тогда
				СтрокаТЧ=ДокПередачи.Товары.Добавить();
				СтрокаТЧ.Номенклатура=ВыборкаНоменклатуры.Номенклатура;
				СтрокаТЧ.ВидЦены=ВидЦены;
				Списать= Мин(ВыборкаНоменклатуры.Количество,МассивНашли[0].Количество);
				СтрокаТЧ.Количество=Списать; 
				СтрокаТЧ.КоличествоУпаковок=Списать;
				СтруктураДействий = Новый Структура;
				СтруктураДействий.Вставить("ЗаполнитьЦенуПродажи", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияЦеныВСтрокеТЧ(ДокПередачи));
				СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС",   Новый Структура("НалогообложениеНДС, Дата", ДокПередачи.НалогообложениеНДС, ДокПередачи.Дата));
				СтруктураДействий.Вставить("ПересчитатьСуммуНДС",  ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(ДокПередачи));
				СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", Новый Структура("ЦенаВключаетНДС", ДокПередачи.ЦенаВключаетНДС));
				СтруктураДействий.Вставить("ПересчитатьСумму");
				СтруктураДействий.Вставить("ПроверитьСтатьюАналитикуРасходов", СтрокаТЧ.Номенклатура);
				СтруктураДействий.Вставить("ОчиститьСуммуВзаиморасчетов");
				КэшированныеЗначения=Неопределено;
				ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокаТЧ, СтруктураДействий, КэшированныеЗначения);
				МассивНашли[0].Количество=МассивНашли[0].Количество-Списать;
			КонецЕсли;
		КонецЦикла;
		//*************************************************************************
		Успешно=Ложь;
		Если ДокПередачи.Товары.Количество()>0 тогда 
			// ДокПередачи.ОбменДанными.Загрузка=Истина;
			Попытка 
				ДокПередачи.Записать(РежимЗаписиДокумента.Запись);
				
				Успешно=Истина;
			исключение
				ЗаписьЖурналаРегистрации("Проблема с записью документа",УровеньЖурналаРегистрации.Ошибка,ДокПередачи,ОписаниеОшибки(),);
				ТекстОшибки=ТекстОшибки+ "Не записался документ!"+Строка(ОписаниеОшибки());
				Успешно=Ложь;
			КонецПопытки;
			Если Успешно тогда
				Попытка
					ДокПередачи.Записать(РежимЗаписиДокумента.Проведение);
					ТекстУспех=ТекстУспех+"Проведен документ:"+Строка(ДокПередачи)+";";
				Исключение
					ТекстОшибки= ТекстОшибки+ "Не провелся документ!"+Строка(ОписаниеОшибки());
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		//*************************************************************************
	КонецЦикла;
	
	Если ТекстОшибки="" тогда
		ЗаполнитьСтруктуруОтвета(СтруктураОтвет,200,"",Истина,ТекстУспех);
		Возврат СтруктураОтвет; 
	иначе
		ЗаполнитьСтруктуруОтвета(СтруктураОтвет,405,ТекстОшибки,Ложь,"");
		Возврат СтруктураОтвет; 
	КонецЕсли;
	
КонецФункции // СоздатьДокументПеремещения()

Функция ВыгрузитьДокументРеализации(ПараматрыВходящие)
	
	СтруктураОтвет = Новый Структура("ДанныеОтвета,Отработало,ТекстОшибки,КодОтвета","",Истина,"",200);	
	ТекстОшибки="";
	ТекстУспех="";
	//1.десериализуем данные о клиенте из JSON
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ПараматрыВходящие.ТелоЗапроса);
	ДанныеДокумента = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();	
	Если ПараматрыВходящие.ПараметрыЗапроса.Количество()>0 тогда
		ТипДока="ПриобретениеТоваровУслуг";
	иначе
		ТипДока="РеализацияТоваровУслуг";
	КонецЕсли;
	
	ТЗдок=Новый ТаблицаЗначений;
	ТЗдок.Колонки.Добавить("Номер",ОбщегоНазначения.ОписаниеТипаСтрока(20));
	ТЗдок.Колонки.Добавить("Дата",ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	Для Каждого СтрМасс из ДанныеДокумента Цикл
		НоваяСтрока=ТЗдок.Добавить(); 
		НоваяСтрока.Номер= СтрМасс.Номер;
		НоваяСтрока.Дата=Дата(СтрМасс.Дата);
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗ.Дата КАК Дата,
		|	ТЗ.Номер КАК Номер
		|ПОМЕСТИТЬ Временная
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	"+ТипДока+".Ссылка КАК Ссылка
		|ИЗ
		|	Временная КАК Временная
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ."+ТипДока+" КАК "+ТипДока+"
		|		ПО Временная.Дата = "+ТипДока+".Дата
		|			И Временная.Номер = "+ТипДока+".Номер
		|ГДЕ
		|	"+ТипДока+".Проведен";
	
	Запрос.УстановитьПараметр("ТЗ", ТЗдок);
	СписокДокументов=новый СписокЗначений;
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СписокДокументов.Добавить(ВыборкаДетальныеЗаписи.ссылка);
	КонецЦикла;
	
СтруктураПараметров=Новый Структура;

СтруктураПараметров.Вставить("ВерсияФормата","1.5");
ТзДополнительнаяРегистрация=Новый ТаблицаЗначений;
ТзДополнительнаяРегистрация.Колонки.Добавить("ВыборПериода",Новый ОписаниеТипов("Булево"));
ТзДополнительнаяРегистрация.Колонки.Добавить("Количество",ОбщегоНазначения.ОписаниеТипаСтрока(100));
ТзДополнительнаяРегистрация.Колонки.Добавить("Отбор");
ТзДополнительнаяРегистрация.Колонки.Добавить("ОтборСтрокой",ОбщегоНазначения.ОписаниеТипаСтрока(100));
ТзДополнительнаяРегистрация.Колонки.Добавить("Период",ОбщегоНазначения.ОписаниеТипаСтрока(100));
ТзДополнительнаяРегистрация.Колонки.Добавить("ПолноеИмяМетаданных",ОбщегоНазначения.ОписаниеТипаСтрока(100));
ТзДополнительнаяРегистрация.Колонки.Добавить("Представление",ОбщегоНазначения.ОписаниеТипаСтрока(100));

ПользовательскиеНастройки = Новый ПользовательскиеНастройкиКомпоновкиДанных;
ПользовательскиеОтборы = ПользовательскиеНастройки.Элементы.Добавить(Тип("ОтборКомпоновкиДанных"));
ЭлементОтбора=ПользовательскиеОтборы.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
ЭлементОтбора.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("Ссылка");
ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
ЭлементОтбора.ПравоеЗначение = СписокДокументов;
ЭлементОтбора.Использование = Истина;
ЭлементОтбора.Применение=ТипПримененияОтбораКомпоновкиДанных.Элементы;

СтандартПериод=Новый СтандартныйПериод;
СтандартПериод.Вариант=ВариантСтандартногоПериода.ПроизвольныйПериод;

НоваяСтрокаТЗрегистрации=ТзДополнительнаяРегистрация.Добавить();
НоваяСтрокаТЗрегистрации.ВыборПериода=Ложь;
НоваяСтрокаТЗрегистрации.Количество="";
НоваяСтрокаТЗрегистрации.Отбор=ПользовательскиеОтборы;
НоваяСтрокаТЗрегистрации.ОтборСтрокой=строка(ПользовательскиеОтборы);
НоваяСтрокаТЗрегистрации.Период=СтандартПериод;
НоваяСтрокаТЗрегистрации.ПолноеИмяМетаданных="Документ."+ТипДока;
НоваяСтрокаТЗрегистрации.Представление=ТипДока;


СтруктураПараметров.Вставить("МестоВыгрузки",1);
СтруктураПараметров.Вставить("ПериодОтбораВсехДокументов",СтандартПериод);
СтруктураПараметров.Вставить("ПустьКМенеджеруОбменаВыгрузки","");
СтруктураПараметров.Вставить("УзелОбмена",Неопределено);
СтруктураПараметров.Вставить("ЭтоФоновоеЗадание",Истина);
СтруктураПараметров.Вставить("ДополнительнаяРегистрация",ТзДополнительнаяРегистрация);
Обработка = Обработки.ВыгрузкаЗагрузкаEnterpriseData.Создать();
РезультатВыгрузки=Обработка.РезультатВыгрузкиВXML(СтруктураПараметров);
XMLответ=ПолучитьИзВременногоХранилища(РезультатВыгрузки);
ЗаполнитьСтруктуруОтвета(СтруктураОтвет,200,"",Истина,XMLответ);
Возврат СтруктураОтвет; 
КонецФункции

Функция СоздатьДокКорректировкиСписания(ПараматрыВходящие)
	СтруктураОтвет = Новый Структура("ДанныеОтвета,Отработало,ТекстОшибки,КодОтвета","",Истина,"",400);	
	ТекстОшибки="";
	ТекстУспех="";
	
	ТекстXML="";
	
	//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 08.02.2021 11:23:29   временно
	//УчетнаяЗапись=РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	//ДанныеДляОтправки=Новый Структура;
	//ДанныеДляОтправки.Вставить("Кому","karateev@smart-t.ru"); //+-#1207 смарт: Каратеев 06.10.2022 //Замена получателя рассылки. 
	//ДанныеДляОтправки.Вставить("Тема","В базе УТ загружается взаиморасчет!");
	//ДанныеДляОтправки.Вставить("Тело","Проведена Корректировка: "+ПараматрыВходящие.ТелоЗапроса);
	//ДанныеДляОтправки.Вставить("ТипТекста",ТипТекстаПочтовогоСообщения.ПростойТекст);
	//ДанныеДляОтправки.Вставить("Важность",ВажностьИнтернетПочтовогоСообщения.Высокая);
	//РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗапись,ДанныеДляОтправки);
	//Смарт }Подкин Алексей Иванович 08.02.2021 11:23:29
	
	ЗаписьЖурналаРегистрации("Получен документ корректировки, фоновое задание, запуск!!!",УровеньЖурналаРегистрации.Предупреждение,,,);
	Если ПараматрыВходящие.Свойство("ТелоЗапроса") и ЗначениеЗаполнено(ПараматрыВходящие.ТелоЗапроса) Тогда
		ТекстXML=ПараматрыВходящие.ТелоЗапроса;
		ЗаписьЖурналаРегистрации("Получен документ корректировки, из базы Бух",УровеньЖурналаРегистрации.Информация,,ТекстXML,);
	иначе
		
		ЗаполнитьСтруктуруОтвета(СтруктураОтвет,400,"Не найден текст выгрузки Корректировки долга! в УТ",Ложь,"");
		Возврат СтруктураОтвет;
		
	КонецЕсли; 
	
	//Загрузим документы	
	
	//СтруктураПараметров = Новый Структура;
	//СтруктураПараметров.Вставить("ТекстXML", ТекстXML);
	//СтруктураПараметров.Вставить("ПутьКМенеджеруОбменаЗагрузки", );
	//СтруктураПараметров.Вставить("ВерсияФормата", "1.7");
	//СтруктураПараметров.Вставить("ЭтоФоновоеЗадание", Истина);
	//
	//ПараметрыЗадания = Новый Структура;
	//ПараметрыЗадания.Вставить("ИмяОбработки", "ВыгрузкаЗагрузкаEnterpriseData");
	//ПараметрыЗадания.Вставить("ИмяМетода", "ЗагрузкаСообщения");
	//ПараметрыЗадания.Вставить("ПараметрыВыполнения", СтруктураПараметров);
	//ПараметрыЗадания.Вставить("ЭтоВнешняяОбработка", Ложь);
	
	АдресРезультата = ПолучитьИмяВременногоФайла("xml");
	Обработка = Обработки.ВыгрузкаЗагрузкаEnterpriseData.Создать();
	Обработка.УзелОбмена = ПланыОбмена.СинхронизацияДанныхЧерезУниверсальныйФормат.НайтиПоКоду("f2a1c910-df81-11e8-a28b-9a091c6056b7");
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ТекстXML);
	РезультатЗагрузки = Обработка.ЗагрузитьДанныеИзXML(ЧтениеXML);
	ЧтениеXML.Закрыть();
	
	Если РезультатЗагрузки.ЕстьОшибки тогда
		Сообщить(РезультатЗагрузки.ТекстОшибки); 
		ЗаполнитьСтруктуруОтвета(СтруктураОтвет,400,"Ошибка загрузки документа в УТ",Ложь,"");
		Возврат СтруктураОтвет;
	КонецЕсли;
	
	Для Каждого ЗагруженнаяСтрока из РезультатЗагрузки.ЗагруженныеОбъекты Цикл
		Если ТипЗнч(ЗагруженнаяСтрока.Ссылка)=тип("ДокументСсылка.ВзаимозачетЗадолженности") или
			ТипЗнч(ЗагруженнаяСтрока.Ссылка)=тип("ДокументСсылка.СписаниеЗадолженности") Тогда
			ДокОбъект=ЗагруженнаяСтрока.Ссылка.ПолучитьОбъект();
			Если ДокОбъект.Проведен Тогда
				ЗаполнитьСтруктуруОтвета(СтруктураОтвет,200,"",Истина,Строка(ДокОбъект) + " документ создан и проведен в  УТ!");
			Иначе	
				ЗаполнитьСтруктуруОтвета(СтруктураОтвет,200,"",Истина,Строка(ДокОбъект) + " документ записан в УТ!");
				//Попытка
				//	ДокОбъект.Записать(РежимЗаписиДокумента.Проведение); 
				//	ЗаполнитьСтруктуруОтвета(СтруктураОтвет,200,Строка(ДокОбъект) + " документ создан и проведен!",Истина,"");
				//Исключение
				//	ДокОбъект.Записать(РежимЗаписиДокумента.Запись); 
				//	ЗаполнитьСтруктуруОтвета(СтруктураОтвет,201,Строка(ДокОбъект) + " не удалось провести документ!",Истина,"");
				//КонецПопытки;
			КонецЕсли; 
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтруктураОтвет;

КонецФункции // ()

Функция СоздатьДокКорректировкиРегистров(ПараматрыВходящие)
	
	СтруктураОтвет = Новый Структура("ДанныеОтвета,Отработало,ТекстОшибки,КодОтвета","",Истина,"",400);	
	ТекстОшибки="";
	ТекстУспех="";
	
	НомерКорректировкиДолга=ПараматрыВходящие.ПараметрыЗапроса.Получить("Number");
	ДатаКорректировкиДолга=Дата(ПараматрыВходящие.ПараметрыЗапроса.Получить("Date"));
	ДатаОперации = Дата(ПараматрыВходящие.ПараметрыЗапроса.Получить("DateOperation"));
	
	Запрос= Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	ВзаимозачетЗадолженности.Ссылка КАК Ссылка,
	|	0 КАК Порядок
	|ИЗ
	|	Документ.ВзаимозачетЗадолженности КАК ВзаимозачетЗадолженности
	|ГДЕ
	|	ВзаимозачетЗадолженности.Номер = &Номер
	|	И НАЧАЛОПЕРИОДА(ВзаимозачетЗадолженности.Дата, ДЕНЬ) = &Дата
	
	|ОБЪЕДИНИТЬ ВСЕ
	
	|ВЫБРАТЬ
	|	ВзаимозачетЗадолженности.Ссылка,
	|	1
	|ИЗ
	|	Документ.ВзаимозачетЗадолженности КАК ВзаимозачетЗадолженности
	|ГДЕ
	|	ВзаимозачетЗадолженности.Комментарий ПОДОБНО &Номер
	
	|ОБЪЕДИНИТЬ ВСЕ
	
	|ВЫБРАТЬ
	|	СписаниеЗадолженности.Ссылка,
	|	2
	|ИЗ
	|	Документ.СписаниеЗадолженности КАК СписаниеЗадолженности
	|ГДЕ
	|	СписаниеЗадолженности.Номер = &Номер
	|	И НАЧАЛОПЕРИОДА(СписаниеЗадолженности.Дата, ДЕНЬ) = &Дата
	
	|ОБЪЕДИНИТЬ ВСЕ
	
	|ВЫБРАТЬ
	|	СписаниеЗадолженности.Ссылка,
	|	3
	|ИЗ
	|	Документ.СписаниеЗадолженности КАК СписаниеЗадолженности
	|ГДЕ
	|	СписаниеЗадолженности.Комментарий ПОДОБНО &Номер
	|	И НАЧАЛОПЕРИОДА(СписаниеЗадолженности.Дата, ДЕНЬ) = &Дата";
	Запрос.УстановитьПараметр("Номер",НомерКорректировкиДолга);
	Запрос.УстановитьПараметр("Дата",НачалоДня(ДатаКорректировкиДолга));
	Выборка=Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ДокументКорректировки=Выборка.Ссылка;
	иначе
		ДокументКорректировки=Неопределено;
		ЗаполнитьСтруктуруОтвета(СтруктураОтвет,400,"Не найден документ корректировки в УТ!",Ложь,"");
		Возврат СтруктураОтвет; 
	КонецЕсли; 
			
	ДокументКорректировка = Документы.КорректировкаРегистров.СоздатьДокумент();
	
	ДокументКорректировка.Дата = ?(ЗначениеЗаполнено(ДатаОперации),ДатаОперации,ТекущаяДата());
	ДокументКорректировка.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	ДокументКорректировка.Организация=ДокументКорректировки.Организация;	
	ДокументОбъект = ДокументКорректировки.ПолучитьОбъект();
	
	МетаданныеДвижений = ДокументОбъект.Метаданные().Движения;
	
	Для Каждого ТаблицаДвижений Из МетаданныеДвижений Цикл
		
		ИмяТаблицы = ТаблицаДвижений.Имя;
		ДокументОбъект.Движения[ИмяТаблицы].Прочитать();
		
		Если ДокументОбъект.Движения[ИмяТаблицы].Количество() > 0 Тогда
			ДокументКорректировка.ТаблицаРегистров.Добавить().Имя = ИмяТаблицы;
			ТаблицаДвиженийВыгруженная = ДокументОбъект.Движения[ИмяТаблицы].Выгрузить();
			СторнироватьТаблицу(ТаблицаДвиженийВыгруженная);
			ДокументКорректировка.Движения[ИмяТаблицы].Загрузить(ТаблицаДвиженийВыгруженная);
		КонецЕсли;
		Для каждого СтрКорр Из ДокументОбъект.Движения[ИмяТаблицы] Цикл
			Попытка
				Если  Метаданные.РегистрыНакопления[ИмяТаблицы].Измерения.Найти("АналитикаУчетаПоПартнерам")<>Неопределено тогда
					АналитикаУчПоПартнерам=СтрКорр.АналитикаУчетаПоПартнерам;
					ЗаказКлиента= СтрКорр.ЗаказКлиента;
				КонецЕсли; 
			Исключение
			КонецПопытки;
		КонецЦикла; 
		
	КонецЦикла;
	
	ДокументКорректировка.Комментарий = "Сторно документа " + ДокументОбъект; 
	
	РегистраторРасчета=Неопределено;
	Если ЗначениеЗаполнено(АналитикаУчПоПартнерам) Тогда
		ЗапросРег=Новый Запрос;
		ЗапросРег.Текст="ВЫБРАТЬ
		|	РегистраторРасчетов.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.РегистраторРасчетов КАК РегистраторРасчетов
		|ГДЕ
		|	РегистраторРасчетов.АналитикаУчетаПоПартнерам = &АналитикаУчетаПоПартнерам
		|	И РегистраторРасчетов.ОбъектРасчетов = &ОбъектРасчетов";
		ЗапросРег.УстановитьПараметр("АналитикаУчетаПоПартнерам",АналитикаУчПоПартнерам);
		ЗапросРег.УстановитьПараметр("ОбъектРасчетов",ЗаказКлиента);
		Результат=ЗапросРег.Выполнить();
		Если Не Результат.Пустой() Тогда  
			Выборка=Результат.Выбрать();
			Если Выборка.Следующий() Тогда
				РегистраторРасчета=Выборка.Ссылка;
			КонецЕсли; 
		КонецЕсли; 
		
		Если РегистраторРасчета<>Неопределено Тогда
			ДокументОбъектКорр = РегистраторРасчета.ПолучитьОбъект();
			
			МетаданныеДвижений = ДокументОбъектКорр.Метаданные().Движения;
			
			Для Каждого ТаблицаДвижений Из МетаданныеДвижений Цикл
				
				ИмяТаблицы = ТаблицаДвижений.Имя;
				ДокументОбъектКорр.Движения[ИмяТаблицы].Прочитать();
				
				Если ДокументОбъектКорр.Движения[ИмяТаблицы].Количество() > 0 Тогда
					ДокументКорректировка.ТаблицаРегистров.Добавить().Имя = ИмяТаблицы;
					ТаблицаДвиженийВыгруженная = ДокументОбъектКорр.Движения[ИмяТаблицы].Выгрузить();
					СторнироватьТаблицу(ТаблицаДвиженийВыгруженная);
					ДокументКорректировка.Движения[ИмяТаблицы].Загрузить(ТаблицаДвиженийВыгруженная);
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли; 
	
	ДокументКорректировка.Комментарий = ДокументКорректировка.Комментарий+"; "+ДокументОбъектКорр+" "+Символы.ПС+"#Загружен из базы 1с бухгалтерии.";
	СинонимДокумента = ДокументКорректировка.Метаданные().Синоним;
	
	Попытка
		ДокументКорректировка.Записать();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Создан документ " + ДокументКорректировка.Ссылка, ДокументКорректировка.Ссылка);
		ТекстУспех=ТекстУспех+"Записан документ:"+Строка(ДокументКорректировка)+";";

	Исключение
		ТекстОшибки="Не удалось записать документ """ + СинонимДокумента + """ по причине
			|" + ОписаниеОшибки();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось записать документ """ + СинонимДокумента + """ по причине
			|" + ОписаниеОшибки()); 
	КонецПопытки;
		
	Если ТекстОшибки="" тогда
		ЗаполнитьСтруктуруОтвета(СтруктураОтвет,200,"",Истина,ТекстУспех);
		Возврат СтруктураОтвет; 
	иначе
		ЗаполнитьСтруктуруОтвета(СтруктураОтвет,405,ТекстОшибки,Ложь,"");
		Возврат СтруктураОтвет; 
	КонецЕсли;
	
КонецФункции // СоздатьДокументПеремещения()

Процедура СторнироватьТаблицу(Таблица)
	
	Для Каждого ТекСтрока Из Таблица Цикл
		
		ТекСтрока["Активность"] = Истина;
		
		Для Каждого ТекКолонка Из Таблица.Колонки Цикл
			
			Если ТекКолонка.Имя = "НомерСтроки" ИЛИ ТекКолонка.Имя = "КодСтроки" Тогда
				Продолжить;
			КонецЕсли;
			
			Если НЕ ТекКолонка.ТипЗначения.СодержитТип(Тип("Число")) Тогда
				Продолжить;
			КонецЕсли;
			
			ТекСтрока[ТекКолонка.Имя] = - ТекСтрока[ТекКолонка.Имя];	
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

//++ #Б5136 смарт: Шляпников 27.01.2026 / Маркировка радиоэлектронной продукции. Синхронизация данных. Приемка товара.
Функция ЗагрузитьДанныеЧерезУниверсальныйОбменДанными(ПараматрыВходящие)
	
	СтруктураОтвет = Новый Структура("ДанныеОтвета,Отработало,ТекстОшибки,КодОтвета", "", Истина, "", 400);
	ТекстОшибки = "";
	ТекстУспех = "";
	ТекстXML="";
	
	ЗаписьЖурналаРегистрации("смартЗагрузитьДанныеЧерезУниверсальныйОбменДанными.Начало", УровеньЖурналаРегистрации.Предупреждение,,,);
	Если ПараматрыВходящие.Свойство("ТелоЗапроса") И ЗначениеЗаполнено(ПараматрыВходящие.ТелоЗапроса) Тогда
		ТекстXML = ПараматрыВходящие.ТелоЗапроса;
		ЗаписьЖурналаРегистрации("смартЗагрузитьДанныеЧерезУниверсальныйОбменДанными.Данные", УровеньЖурналаРегистрации.Информация,, ТекстXML,);
	Иначе
		ЗаполнитьСтруктуруОтвета(СтруктураОтвет, 400, "Не найдены данные для загрузки в УТ", Ложь, "");
		Возврат СтруктураОтвет;
	КонецЕсли; 
	
	ИмяФайлаЗагрузки = ПолучитьИмяВременногоФайла("xml");
	Текст = Новый ТекстовыйДокумент;
	Текст.ДобавитьСтроку(ТекстXML);
	Текст.Записать(ИмяФайлаЗагрузки);
	
	Обработка = Обработки.УниверсальныйОбменДаннымиXML.Создать();
	Обработка.ИмяФайлаОбмена = ИмяФайлаЗагрузки;
    Обработка.РежимОбмена = "Загрузка";
	Обработка.ЗагружатьДанныеВРежимеОбмена = Истина;
    Обработка.ОткрытьФайлЗагрузки(Истина);
    Обработка.АрхивироватьФайл = Ложь;
	
    Обработка.ВыполнитьЗагрузку();
	
	УдалитьФайлы(ИмяФайлаЗагрузки);
    Обработка = Неопределено;
	
	ЗаполнитьСтруктуруОтвета(СтруктураОтвет, 200, "", Истина, "Данные загружены");
	
	Возврат СтруктураОтвет;

КонецФункции

//Заполняем структуру ответа
Процедура ЗаполнитьСтруктуруОтвета(СтруктураОтвет,КодОтвета,ТекстОшибки,Отработало,ДанныеОтвета)
	СтруктураОтвет.КодОтвета 	= КодОтвета;
	СтруктураОтвет.ТекстОшибки	= ТекстОшибки;
	СтруктураОтвет.Отработало	= Отработало;
	СтруктураОтвет.ДанныеОтвета = ДанныеОтвета;	
КонецПроцедуры

Функция ВывестиРезультатМенеджераВременныхТаблиц(МенеджерВременныхТаблиц, ИмяТаблицы) Экспорт
	
	//Получаем таблицу из менеджера временных таблиц запроса
	Запрос = Новый Запрос("ВЫБРАТЬ * ИЗ "+ИмяТаблицы);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции
